# Pandas

Panda is a fast,powerful,flexible and easy to use open source data analysis and manipulation tool built on top of the Python programming language.

In [3]:
import pandas as pd 
import numpy as np

## Basic Data Structures in pandas

Series: a one-dimensional labeled array holding data of any type
such as integers, strings, Python objects etc.

DataFrame: a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

In [6]:
df=pd.DataFrame({"Roll No":[1,2,3,],"Stu Name":['Vikas','Tarun','Abhishek']})
df

   Roll No  Stu Name
0        1     Vikas
1        2     Tarun
2        3  Abhishek

In [7]:
# Defining the type of dataframe 
type(df)

pandas.core.frame.DataFrame

## What is NaN ?
#NumPy NAN stands for not a number and is defined as a substitute for declaring value which are numerical values that are missing values in an array as NumPy is used to deal with arrays in Python and this can be initialized using numpy.

## Difference between NaN & Null
`NaN` is a special floating-point value used in numeric computations, particularly with the `numpy` and `pandas` libraries
 Null is often used in situations where the absence of a value is a valid and meaningful concept

In [10]:
#why roll number changes to float value when we replace 2 with np.nan
df=pd.DataFrame({"Roll No":[1,np.nan,3],"Stu Name":['Vikas','Tarun','Abhishek']},)
df

   Roll No  Stu Name
0      1.0     Vikas
1      NaN     Tarun
2      3.0  Abhishek

In [11]:
# Change: data type of values in the columns changes to float

## Why Roll No changes to float
`NaN` is a special floating-point value used in numeric computations, particularly with the `numpy` and `pandas` libraries
 Null is often used in situations where the absence of a value is a valid and meaningful concept

In [13]:
# is it posssible to convert value into int while using nan and how it is done? 
df['Roll No']=df['Roll No']
df

   Roll No  Stu Name
0      1.0     Vikas
1      NaN     Tarun
2      3.0  Abhishek

## How to convert roll no into integer value with np.nan?
fillna(-1): Fills NaN values with -1. You can choose any placeholder value that makes sense for your context.

astype(int): Converts the column to an integer type (int64)

In [15]:
# method 1
df['Roll No']=df['Roll No'].fillna(-1).astype(int)
df

   Roll No  Stu Name
0        1     Vikas
1       -1     Tarun
2        3  Abhishek

In [16]:
# Method 2
df = pd.DataFrame({'Roll Number': [1,np.nan,3,4]})
df['Roll Number'] = df['Roll Number'].astype(pd.Int64Dtype())
df

   Roll Number
0            1
1         <NA>
2            3
3            4

In [17]:
# Series
ad = pd.Series([1,3,5,6])
ad

0    1
1    3
2    5
3    6
dtype: int64

In [18]:
# object creation
dates=pd.date_range("20240102",periods=4)

In [19]:
#generating dataframe with random num
sd=pd.DataFrame(np.random.randn(4,4))
sd

          0         1         2         3
0 -0.307120  0.275884 -0.773132 -0.767686
1  0.136889  1.585432  1.092796 -0.063587
2  1.220423 -0.902243 -0.238424  0.812140
3 -0.472770 -0.939129  1.778511  1.285501

In [20]:
# replacing index woth dates
sd=pd.DataFrame(np.random.randn(4,4),index=dates)
sd

                   0         1         2         3
2024-01-02  0.675315  0.872458  0.497414 -0.684031
2024-01-03  0.599866  0.776468 -0.148727  0.785721
2024-01-04  0.726065  0.275913 -0.977367  0.620368
2024-01-05  1.852324 -1.136512  0.803607  0.678171

In [21]:
# replacing columns with list
sd=pd.DataFrame(np.random.randn(4,4),index=dates,columns=list("ABCD"))#columns as slot 1 ,slot2 ?
sd

                   A         B         C         D
2024-01-02  0.837569 -0.072370 -0.410808  0.796860
2024-01-03  0.606078  0.730812  0.562375 -0.323319
2024-01-04  1.156886  0.251319  1.015841 -1.813894
2024-01-05  0.819706  0.714510  1.426745 -0.712987

In [22]:
# Replacing column name as slot 1,slot 2,slot 3,slot 4
sd=pd.DataFrame(np.random.randn(4,4),index=dates,columns=list(["Slot 1","Slot 2","Slot 3","Slot 4"]))#columns as slot 1 ,slot2 ?
sd

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-02  0.602718  1.319289  0.541694 -0.515991
2024-01-03 -1.330379 -1.319802  0.261632  0.374631
2024-01-04 -1.087202  0.055295  3.490454 -2.192428
2024-01-05  1.338594  0.417339  0.747849  1.091813

In [23]:
# converting to numpy array
sd.to_numpy()

array([[ 0.602718  ,  1.31928858,  0.54169365, -0.51599075],
       [-1.33037896, -1.31980226,  0.26163225,  0.37463093],
       [-1.08720151,  0.05529475,  3.49045434, -2.19242795],
       [ 1.33859363,  0.41733889,  0.74784901,  1.09181279]])

In [24]:
# Index of dataframe
sd.index

DatetimeIndex(['2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'], dtype='datetime64[ns]', freq='D')

In [25]:
# Columns of dataframe
sd.columns

Index(['Slot 1', 'Slot 2', 'Slot 3', 'Slot 4'], dtype='object')

## Sorting by axis and value

In [27]:
sd.sort_index(axis=1,ascending=False)

              Slot 4    Slot 3    Slot 2    Slot 1
2024-01-02 -0.515991  0.541694  1.319289  0.602718
2024-01-03  0.374631  0.261632 -1.319802 -1.330379
2024-01-04 -2.192428  3.490454  0.055295 -1.087202
2024-01-05  1.091813  0.747849  0.417339  1.338594

In [28]:
sd.sort_index(axis=0,ascending=False)

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-05  1.338594  0.417339  0.747849  1.091813
2024-01-04 -1.087202  0.055295  3.490454 -2.192428
2024-01-03 -1.330379 -1.319802  0.261632  0.374631
2024-01-02  0.602718  1.319289  0.541694 -0.515991

In [29]:
sd.sort_values(by="Slot 3",ascending=False)  # Task : sort on c and d   # default

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-04 -1.087202  0.055295  3.490454 -2.192428
2024-01-05  1.338594  0.417339  0.747849  1.091813
2024-01-02  0.602718  1.319289  0.541694 -0.515991
2024-01-03 -1.330379 -1.319802  0.261632  0.374631

In [30]:
# Task : sort on slot 3 and slot 4
sd = sd.sort_values(by=['Slot 3', 'Slot 4'], ascending=[True, True])
sd

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-03 -1.330379 -1.319802  0.261632  0.374631
2024-01-02  0.602718  1.319289  0.541694 -0.515991
2024-01-05  1.338594  0.417339  0.747849  1.091813
2024-01-04 -1.087202  0.055295  3.490454 -2.192428

In [31]:
# assigning values of column A dataframe to variable dfa
dfa=sd["Slot 1"]
dfa

2024-01-03   -1.330379
2024-01-02    0.602718
2024-01-05    1.338594
2024-01-04   -1.087202
Name: Slot 1, dtype: float64

In [32]:
# select rows 0 to 2
sd[0:3]

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-03 -1.330379 -1.319802  0.261632  0.374631
2024-01-02  0.602718  1.319289  0.541694 -0.515991
2024-01-05  1.338594  0.417339  0.747849  1.091813

In [33]:
#select columns a & b
sd.loc[ : ,['Slot 1','Slot 2']]

              Slot 1    Slot 2
2024-01-03 -1.330379 -1.319802
2024-01-02  0.602718  1.319289
2024-01-05  1.338594  0.417339
2024-01-04 -1.087202  0.055295

In [34]:
sd.at[dates[2],"Slot 1"]   # access only single element

-1.0872015071013434

In [35]:
#selecting specfic row from a column specifying given condition
filteredsd=sd[sd['Slot 1']> -1]
filteredsd

              Slot 1    Slot 2    Slot 3    Slot 4
2024-01-02  0.602718  1.319289  0.541694 -0.515991
2024-01-05  1.338594  0.417339  0.747849  1.091813

In [36]:
sd["E"]=[1,2,3,4]
sd

              Slot 1    Slot 2    Slot 3    Slot 4  E
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1
2024-01-02  0.602718  1.319289  0.541694 -0.515991  2
2024-01-05  1.338594  0.417339  0.747849  1.091813  3
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4

## Missing Data

In [38]:
sd["f"]=[9,np.nan,np.nan,1]
sd

              Slot 1    Slot 2    Slot 3    Slot 4  E    f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.0
2024-01-02  0.602718  1.319289  0.541694 -0.515991  2  NaN
2024-01-05  1.338594  0.417339  0.747849  1.091813  3  NaN
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0

In [39]:
#drp all rows having nan
sd.dropna(how="any")

              Slot 1    Slot 2    Slot 3    Slot 4  E    f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.0
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0

In [40]:
# drop all nan rows with specific column having nan
sd.dropna(subset=['f'])

              Slot 1    Slot 2    Slot 3    Slot 4  E    f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.0
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0

In [41]:
#fill 5 in placee of na
sd.fillna(5).astype(int)

            Slot 1  Slot 2  Slot 3  Slot 4  E  f
2024-01-03      -1      -1       0       0  1  9
2024-01-02       0       1       0       0  2  5
2024-01-05       1       0       0       1  3  5
2024-01-04      -1       0       3      -2  4  1

In [42]:
# replace nan with mean value of that column
sd.fillna(sd['Slot 1'].mean())

              Slot 1    Slot 2    Slot 3    Slot 4  E         f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.000000
2024-01-02  0.602718  1.319289  0.541694 -0.515991  2 -0.119067
2024-01-05  1.338594  0.417339  0.747849  1.091813  3 -0.119067
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.000000

In [43]:
#position having na value get replced by true other with false
sd.isna()

            Slot 1  Slot 2  Slot 3  Slot 4      E      f
2024-01-03   False   False   False   False  False  False
2024-01-02   False   False   False   False  False   True
2024-01-05   False   False   False   False  False   True
2024-01-04   False   False   False   False  False  False

In [44]:
sd.mean()

Slot 1   -0.119067
Slot 2    0.118030
Slot 3    1.260407
Slot 4   -0.310494
E         2.500000
f         5.000000
dtype: float64

In [45]:
sd['Slot 1'].mean() # mean of a specific columns

-0.11906720819043631

In [46]:
sd.mean(axis=0)

Slot 1   -0.119067
Slot 2    0.118030
Slot 3    1.260407
Slot 4   -0.310494
E         2.500000
f         5.000000
dtype: float64

In [47]:
# to check weather there is nan value or not
sd.isna()

            Slot 1  Slot 2  Slot 3  Slot 4      E      f
2024-01-03   False   False   False   False  False  False
2024-01-02   False   False   False   False  False   True
2024-01-05   False   False   False   False  False   True
2024-01-04   False   False   False   False  False  False

## Operation

In [49]:
sd.mean(axis=1)

2024-01-03    1.331014
2024-01-02    0.789542
2024-01-05    1.319119
2024-01-04    0.877687
dtype: float64

In [50]:
sd.mean(axis=0)

Slot 1   -0.119067
Slot 2    0.118030
Slot 3    1.260407
Slot 4   -0.310494
E         2.500000
f         5.000000
dtype: float64

In [51]:
sd.mean()

Slot 1   -0.119067
Slot 2    0.118030
Slot 3    1.260407
Slot 4   -0.310494
E         2.500000
f         5.000000
dtype: float64

## Merge
Concat
pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

In [53]:
sd

              Slot 1    Slot 2    Slot 3    Slot 4  E    f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.0
2024-01-02  0.602718  1.319289  0.541694 -0.515991  2  NaN
2024-01-05  1.338594  0.417339  0.747849  1.091813  3  NaN
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0

In [54]:
pieces = [sd[:3], sd[2:4], sd[3:]]
pd.concat(pieces)

              Slot 1    Slot 2    Slot 3    Slot 4  E    f
2024-01-03 -1.330379 -1.319802  0.261632  0.374631  1  9.0
2024-01-02  0.602718  1.319289  0.541694 -0.515991  2  NaN
2024-01-05  1.338594  0.417339  0.747849  1.091813  3  NaN
2024-01-05  1.338594  0.417339  0.747849  1.091813  3  NaN
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0
2024-01-04 -1.087202  0.055295  3.490454 -2.192428  4  1.0

## Grouping
Grouping by a column label, selecting column labels, and then applying the DataFrameGroupBy.sum() function to the resulting groups:

In [56]:
sd.groupby("Slot 1")[["Slot 3", "Slot 4"]].sum()

             Slot 3    Slot 4
Slot 1
-1.330379  0.261632  0.374631
-1.087202  3.490454 -2.192428
 0.602718  0.541694 -0.515991
 1.338594  0.747849  1.091813

In [107]:
# Grouping by multiple columns label forms MultiIndex.
sd.groupby(["Slot 1", "Slot 2"]).sum()

                       Slot 3    Slot 4  E    f
Slot 1    Slot 2
-1.330379 -1.319802  0.261632  0.374631  1  9.0
-1.087202  0.055295  3.490454 -2.192428  4  1.0
 0.602718  1.319289  0.541694 -0.515991  2  0.0
 1.338594  0.417339  0.747849  1.091813  3  0.0